{
  "main": {
    "name":"Ben Berger",
    "occupation":"Fullstack Developer",
    "description":" Creating awesome and effective software and applications for companies of all sizes around the globe. Let's start scrolling and learn more about me.",
    "image":"profilepic.jpg",
    "bio":"Growing up I always had a passion for music and computers, for me they were my means of creation and expression. Throughout the years I've fostered a great deal of creativity and dedication through both outlets and use those skills to drive forward. I've gained proficiency in HTML, CSS/LESS/SASS/Styled Components, JS, React, Redux, Context, Node.js, PostgreSQL, and many other technologies. While always pushing myself to learn more and improve my technical skills I also strive to be a strong leader/team player in any atmosphere I join.",
    "contactmessage":"For any questions or inquiries about work please feel free to contact me!",
    "email": "Bbjberg91@gmail.com",
    "phone": "802-777-0321",
    "address":{
      
      "city":"Baltimore/Remote",
      "state":"Maryland",
      "zip": "21061"
    },
    "website": "http://www.benberger.com",
    "resumedownload":"public\images\portfolio\Benjamin_Berger_Resume.pdf",
    "social":[
      
     
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/benjberg/",
        "className":"fa fa-linkedin"
      },
     
      {
        "name":"github",
        "url":"http://github.com/benjberg",
        "className":"fa fa-github"
      }
     
    ]
  },
  "resume":{
    "skillmessage":"Fullstack Web Developer proficiant in a wide variety of skills and technologies",
    "education":[
      {
        "school":"Lambda",
        "degree":"Fullstack Development",
        "graduated":"2020",
        "description":"Fullstack web debvelopment training specializing in HTML, CSS/LESS/SASS/Styled Components, JS, React, Redux, Node.js, PostgreSQL and more."
      }
    ],
    "work":[
      {
        "company":"Lambda",
        "title":"Team Lead",
        "years":"April 2020 - Present",
        "description":"Driven team to reach 100% completion rate of monthly sprints. Offer guidance and technical help when a member is having a problem be it with the environment or with their code. Act as a liaison to the upper levels of management."
      },
      {
        "company":"EnCon",
        "title":"Fullstack Web Developer",
        "years":"April 2020 - June 2020",
        "description":"Served as a Team Lead and developer for EnCon working on both the front and back end. Developed front end components based on figma wire-frames using React and several libraries (Reacthook-forms, React-router, Re-chart and React-calendar) to ensure functionality and feature flow. Created and deployed backend through heroku with PostgreSQL. I created all table and data structures as well as API to communicate with front end to store and display user info. "
      }
    ],
    "skills":[
      {
        "name":"Git",
        "level":"90%"
      },
      {
        "name":"JavaScript",
        "level":"70%"
      },
      {
        "name":"ReactJs",
        "level":"70%"
      },
      {
        "name":"CSS/LESS/SASS",
        "level":"70%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"Node.js",
        "level":"80%"
      },
      {
        "name":"PostgreSQL",
        "level":"80%"
      }, 
      {
        "name": "Redux",
        "level": "65%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Encon",
        "category":"Encon energy consumption full stack app",
        "image":"Encon.png",
        "url":"https://master.d3dr1o3e9t60pz.amplifyapp.com/"
      },
      {
        "title":"MedCab Backend",
        "category":"full backend project ",
        "image":"github.png",
        "url":"https://github.com/benjberg/BE"
      }
      
     
     
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"Ben continues to be a dynamic member of team who threads the needle between leading and supporting flawlessly. He constantly brings good ideas to the table, is one of the best public speakers on the team, and has written some excellent, clean code. Watching his talents unfold over the course of a challenging project, especially as he maintains a hectic schedule, has been inspiring to watch and I always look forward to seeing more from him.",
        "user":"EnCon Project Lead"
      },
      {
        "text":"Ben is one of the most effective leaders I've met and an incredibly strong developer. He effortlessly unites the web side of the team and helps bring out the best in everyone around him.",
        "user":"EnCon Project Lead"
      }
    ]
  }
}
